# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\jucsalaz\Desktop\CMPE129\UACS\Julian_PSoC\Power\TogglingPin.cydsn\TogglingPin.cyprj
# Date: Tue, 29 May 2018 05:23:06 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyMASTER_CLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 7} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for C:\Users\jucsalaz\Desktop\CMPE129\UACS\Julian_PSoC\Power\TogglingPin.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\jucsalaz\Desktop\CMPE129\UACS\Julian_PSoC\Power\TogglingPin.cydsn\TogglingPin.cyprj
# Date: Tue, 29 May 2018 05:23:02 GMT
