# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\jucsalaz\Desktop\CMPE129\UACS\Winter2018\Julians_Code\TestBench.cydsn\TestBench.cyprj
# Date: Tue, 10 Apr 2018 19:51:46 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyMASTER_CLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} [list [get_pins {ClockBlock/dclk_glb_2}]]


# Component constraints for C:\Users\jucsalaz\Desktop\CMPE129\UACS\Winter2018\Julians_Code\TestBench.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\jucsalaz\Desktop\CMPE129\UACS\Winter2018\Julians_Code\TestBench.cydsn\TestBench.cyprj
# Date: Tue, 10 Apr 2018 19:51:38 GMT
